CATEGORY_CHOICES = [
    ('Диагностика', 'Диагностика'),
    ('Техническое обслуживание', 'Техническое обслуживание'),
    ('Текущий ремонт двигателя', 'Текущий ремонт двигателя'),
    (
        'Токарные, фрезерные, шлифовочные и расточные работы',
        'Токарные, фрезерные, шлифовочные и расточные работы'),
    ('Система питания', 'Система питания'),
    ('Система выпуска газов', 'Система выпуска газов'),
    ('Система охлаждения', 'Система охлаждения'),
    ('Сцепление', 'Сцепление'),
    ('Коробка передач', 'Коробка передач'),
    ('Карданный вал', 'Карданный вал'),
    ('Задний мост', 'Задний мост'),
    ('Подвеска', 'Подвеска'),
    ('Колеса-ступицы', 'Колеса-ступицы'),
    ('Рулевое управление', 'Рулевое управление'),
    ('Тормозная система', 'Тормозная система'),
    ('Электрооборудование', 'Электрооборудование'),
    ('Двери', 'Двери'),
    ('Отопитель', 'Отопитель')
]

PRICE_CATEGORY = [
    ('Газель', 'Газель'),
    ('Валдай Дв Д245/Cummin s 3.8 2.8', 'Валдай Дв Д245/Cummin s 3.8 2.8')
]
