from unittest import TestCase
from models.nomenclature.models import Nomenclature
from services.nomenclature_services import NomenclatureService
from unittest.mock import Mock, patch
from models.organization.models import Organization


class NomenclatureServicesTest(TestCase):
    def test_create_nomenclature(self):
        organization = Mock(spec=Organization, id=1)
        queryset = [Mock(spec=Nomenclature)]
        data = {
            'name': 'CТО',
            'services': [{"Цена": 4000, "Марка": "Газель", "Название": "Компьютерная диагностика двигателя ",
                          "Категория": "Диагностика", "Примечание": "406,405,409 ЕВРО 2,405,409,4216 - ЕВРО 3,4"},
                         {"Цена": 2000, "Марка": "Газель", "Название": "Диагностика ходовой части",
                          "Категория": "Диагностика", "Примечание": ""},
                         {"Цена": 4000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Компьютерная диагностика двигателя ", "Категория": "Диагностика",
                          "Примечание": "406,405,409 ЕВРО 2,405,409,4216 - ЕВРО 3,4"},
                         {"Цена": 2000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Диагностика ходовой части", "Категория": "Диагностика", "Примечание": ""},
                         {"Цена": 1500, "Марка": "Газель", "Название": "Замена масла в двигателе",
                          "Категория": "Техническое обслуживание", "Примечание": "весь модельный ряд"},
                         {"Цена": 500, "Марка": "Газель", "Название": "Замена фильтра воздушного карбюр.двиг.",
                          "Категория": "Техническое обслуживание", "Примечание": "402,4218,4215,406."},
                         {"Цена": 1500, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Замена масла в двигателе", "Категория": "Техническое обслуживание",
                          "Примечание": "весь модельный ряд"}, {"Цена": 250, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                                                                "Название": "Замена фильтра воздушного карбюр.двиг.",
                                                                "Категория": "Техническое обслуживание",
                                                                "Примечание": "402,4218,4215,406."},
                         {"Цена": 7500, "Марка": "Газель", "Название": "Мойка. Чистка масляных каналов перед сборкой",
                          "Категория": "Текущий ремонт двигателя", "Примечание": "весь модельный ряд"},
                         {"Цена": 20000, "Марка": "Газель",
                          "Название": "Замена ГРМ (цепи,звездочки,успокоители и т.п.)",
                          "Категория": "Текущий ремонт двигателя", "Примечание": "406 и модиф"},
                         {"Цена": 7500, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Мойка. Чистка масляных каналов перед сборкой",
                          "Категория": "Текущий ремонт двигателя", "Примечание": "весь модельный ряд"},
                         {"Цена": 45000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Замена ГРМ (цепи,звездочки,успокоители и т.п.)",
                          "Категория": "Текущий ремонт двигателя", "Примечание": "406 и модиф"},
                         {"Цена": 2800, "Марка": "Газель", "Название": "Фрезеровка головки блока цилиндров",
                          "Категория": "Токарные, фрезерные, шлифовочные и расточные работы", "Примечание": ""},
                         {"Цена": 6000, "Марка": "Газель", "Название": "Фрезеровка блока цилиндров",
                          "Категория": "Токарные, фрезерные, шлифовочные и расточные работы", "Примечание": ""},
                         {"Цена": 6000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Фрезеровка головки блока цилиндров",
                          "Категория": "Токарные, фрезерные, шлифовочные и расточные работы", "Примечание": ""},
                         {"Цена": 10000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Фрезеровка блока цилиндров",
                          "Категория": "Токарные, фрезерные, шлифовочные и расточные работы", "Примечание": ""},
                         {"Цена": 6000, "Марка": "Газель", "Название": "Замена погружного модуля бензонасоса ",
                          "Категория": "Система питания", "Примечание": ""}, {"Цена": 8000, "Марка": "Газель",
                                                                              "Название": "Замена погружного модуля бензонасоса со снятием бака",
                                                                              "Категория": "Система питания",
                                                                              "Примечание": ""},
                         {"Цена": 6000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Замена погружного модуля бензонасоса ", "Категория": "Система питания",
                          "Примечание": ""}, {"Цена": 8000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                                              "Название": "Замена погружного модуля бензонасоса со снятием бака",
                                              "Категория": "Система питания", "Примечание": ""},
                         {"Цена": 4000, "Марка": "Газель", "Название": "Замена приемной трубы/ нейтрализатора",
                          "Категория": "Система выпуска газов", "Примечание": "4216,40522,409"},
                         {"Цена": 3000, "Марка": "Газель",
                          "Название": "Замена прокладки приемной трубы/нейтрализатора ",
                          "Категория": "Система выпуска газов", "Примечание": "4216,40522,409"},
                         {"Цена": 6000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Замена приемной трубы/ нейтрализатора", "Категория": "Система выпуска газов",
                          "Примечание": "4216,40522,409"}, {"Цена": 5000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                                                            "Название": "Замена прокладки приемной трубы/нейтрализатора ",
                                                            "Категория": "Система выпуска газов",
                                                            "Примечание": "4216,40522,409"},
                         {"Цена": 5000, "Марка": "Газель", "Название": "Замена радиатора",
                          "Категория": "Система охлаждения", "Примечание": "весь модельный ряд"},
                         {"Цена": 2000, "Марка": "Газель", "Название": "Замена патрубка термостата ",
                          "Категория": "Система охлаждения", "Примечание": "406 и модиф"},
                         {"Цена": 6000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8", "Название": "Замена радиатора",
                          "Категория": "Система охлаждения", "Примечание": "весь модельный ряд"},
                         {"Цена": 2000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Замена патрубка термостата ", "Категория": "Система охлаждения",
                          "Примечание": "406 и модиф"},
                         {"Цена": 10000, "Марка": "Газель", "Название": "Снять-Установить  КПП ",
                          "Категория": "Сцепление", "Примечание": ""},
                         {"Цена": 500, "Марка": "Газель", "Название": "Замена болта педали сцепления",
                          "Категория": "Сцепление", "Примечание": ""},
                         {"Цена": 12000, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Снять-Установить  КПП ", "Категория": "Сцепление", "Примечание": ""},
                         {"Цена": 500, "Марка": "Валдай Дв Д245/Cummin s 3.8 2.8",
                          "Название": "Замена болта педали сцепления", "Категория": "Сцепление", "Примечание": ""}],
        }

        with patch('models.nomenclature.models.Nomenclature.objects.create') as create_nomenclature:
            with patch('models.organization.models.Organization.objects.get') as get_organization:
                create_nomenclature.return_value = Mock(
                    spec=Nomenclature,
                    name=data['name'],
                    services=data['services'],
                    organization=organization
                )

                get_organization.return_value = organization

                nomenclature = NomenclatureService.create_nomenclature(data)
                queryset.append(nomenclature)

                self.assertIn(nomenclature, queryset)
                create_nomenclature.assert_called_once_with(
                    name=data['name'],
                    services=data['services'],
                    organization=organization
                )
                get_organization.assert_called_once_with(id=organization.id)

    def test_get_nomenclature_by_id(self):
        nomenclature = Mock(spec=Nomenclature, id=1)

        with patch('models.nomenclature.models.Nomenclature.objects.get') as get_nomenclature:
            get_nomenclature.return_value = nomenclature

            returned_nomenclature = NomenclatureService.get_nomenclature_by_id(nomenclature_id=nomenclature.id)

            self.assertEqual(returned_nomenclature, nomenclature)
            get_nomenclature.assert_called_once_with(id=nomenclature.id)